<?xml version="1.0"?>
<!DOCTYPE article PUBLIC "-//NLM//DTD JATS (Z39.96) Journal Archiving and Interchange DTD v1.1 20151215//EN" "http://jats.nlm.nih.gov/archiving/1.1/JATS-archivearticle1.dtd">
<article xmlns:xlink="http://www.w3.org/1999/xlink">
  <front>
    <journal-meta><journal-id journal-id-type="other">Journal</journal-id><publisher><publisher-name>Academic Publisher</publisher-name></publisher></journal-meta>
    <article-meta>
      <title-group>
        <article-title>Integra&#xE7;&#xE3;o de sistemas como solu&#xE7;&#xE3;o para implanta&#xE7;&#xE3;o de um reposit&#xF3;rio institucional de artigos cient&#xED;ficos</article-title>
      </title-group>
      <contrib-group content-type="author">
        <contrib contrib-type="author">
          <name><given-names>S&#xE3;o Jo&#xE3;o da Boa Vista - SP</given-names></name>
          <xref ref-type="aff" rid="aff0">0</xref>
        </contrib>
        
      </contrib-group>
      <aff id="aff0">
          
          <institution content-type="orgname">Centro Universita&#x301;rio das Faculdades Associadas de Ensino, UNIFAE</institution>
          ,
          <addr-line>Sa&#x303;o Joa&#x303;o da Boa Vista - SP</addr-line>
          ,
          <country country="BR">Brasil</country>
        </aff><pub-date>
        <year>2018</year>
      </pub-date>
      <abstract>
        <p>O crescimento das produ&#xE7;&#xF5;es cient&#xED;ficas das institui&#xE7;&#xF5;es de ensino e a progressiva ado&#xE7;&#xE3;o de pol&#xED;ticas de Acesso Aberto (AA) por diversas bases indexadoras ao redor do mundo tornam cada vez mais evidente a import&#xE2;ncia da ado&#xE7;&#xE3;o de um sistema de preserva&#xE7;&#xE3;o e recupera&#xE7;&#xE3;o de dados estruturados provenientes de artigos cient&#xED;ficos. Nas institui&#xE7;&#xF5;es de ensino superior essas a&#xE7;&#xF5;es visam a ampla divulga&#xE7;&#xE3;o na Web dos resultados de suas produ&#xE7;&#xF5;es cient&#xED;ficas e tamb&#xE9;m permitir a posterior manipula&#xE7;&#xE3;o desses dados. Este trabalho prop&#xF5;e o uso de t&#xE9;cnicas de integra&#xE7;&#xE3;o de sistemas no desenvolvimento de uma aplica&#xE7;&#xE3;o Web para o cadastro de artigos cient&#xED;ficos e sua posterior disponibiliza&#xE7;&#xE3;o online. S&#xE3;o demonstradas integra&#xE7;&#xF5;es de solu&#xE7;&#xF5;es novas com outras existentes neste cen&#xE1;rio, sendo que a principal leva em conta o uso da plataforma Open Typeset Stack, para obter documentos nos formatos HTML, XML e PDF, a partir de documentos cient&#xED;ficos estruturados no formato DOCX. Palavras-chave sistema de publica&#xE7;&#xF5;es cient&#xED;ficas; open typeset stack; recupera&#xE7;&#xE3;o de dados.</p>
      </abstract>
    </article-meta>
  </front>
  <body>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_1_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_1_2.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_2_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_3_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_4_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_5_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_6_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_7_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_7_2.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_8_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_8_2.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_9_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_10_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_11_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_11_2.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_12_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_13_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_14_1.png"/>
    </fig>
    <fig>
      <graphic xlink:href="var/documents/473/5398/cermine/document.images/img_15_1.png"/>
    </fig>
    <sec id="sec-1">
      <title>1. Introdu&#xE7;&#xE3;o</title>
      <p>A tarefa de disseminar conhecimento tem como auxiliares as ferramentas e sistemas
que possibilitam armazenar e disponibilizar artefatos que descrevem trabalhos e pesquisas
produzidas no meio acad&#xEA;mico.</p>
      <p>Muitas institui&#xE7;&#xF5;es de ensino possuem suas pr&#xF3;prias bases de publica&#xE7;&#xF5;es,
denominadas como Reposit&#xF3;rios Institucionais (RIs), onde pesquisadores s&#xE3;o encorajados a
depositarem seus preprints e postprints com o intuito de aumentar a visibilidade dos
resultados de suas pesquisas (FURNIVAL &amp; HUBBARD, 2011).</p>
    </sec>
    <sec id="sec-2">
      <title>1.1. Justificativa</title>
      <p>Publicar os resultados alcan&#xE7;ados nos trabalhos de conclus&#xE3;o de curso apenas
internamente, no &#xE2;mbito da Institui&#xE7;&#xE3;o de Ensino Superior (IES) onde foram realizados, pode
n&#xE3;o proporcionar a divulga&#xE7;&#xE3;o e alcance desejados aos projetos apresentados pelos alunos que
se encontram em processo de finaliza&#xE7;&#xE3;o de um curso de gradua&#xE7;&#xE3;o. Portanto, a proposta de
elaborar um portal de publica&#xE7;&#xF5;es de trabalhos surgiu da necessidade de tornar o conte&#xFA;do de
tais projetos public&#xE1;vel e de facilitar e ampliar a sua divulga&#xE7;&#xE3;o na rede mundial de
computadores, uma vez que se nota o crescimento da mobilidade e da facilidade no acesso &#xE0;s
informa&#xE7;&#xF5;es.</p>
    </sec>
    <sec id="sec-3">
      <title>1.2. Objetivos</title>
      <p>Diante da necessidade apresentada, objetiva-se neste trabalho desenvolver uma
aplica&#xE7;&#xE3;o web para a publica&#xE7;&#xE3;o de trabalhos de conclus&#xE3;o de curso, desenvolvidos por alunos
em ambiente acad&#xEA;mico. Prev&#xEA;-se neste sistema que os alunos possam se cadastrar, submeter
suas publica&#xE7;&#xF5;es para divulga&#xE7;&#xE3;o na internet, por meio de um portal espec&#xED;fico, e atrav&#xE9;s do
mesmo efetuar consultas sobre as publica&#xE7;&#xF5;es j&#xE1; dispon&#xED;veis.</p>
      <p>Para viabilizar a constru&#xE7;&#xE3;o do sistema web apresentado, &#xE9; proposto fazer uso de
t&#xE9;cnicas de integra&#xE7;&#xE3;o de aplica&#xE7;&#xF5;es, principalmente para viabilizar a obten&#xE7;&#xE3;o do arquivo
correspondente que ser&#xE1; utilizado como base para a transforma&#xE7;&#xE3;o do documento
originalmente publicado em um formato compat&#xED;vel com as normas estabelecidas pelo &#xF3;rg&#xE3;o
regulamentador da internet (W3C - World Wide Web Consortium), para que finalmente possa
Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 2
ser publicado em uma p&#xE1;gina web onde o trabalho ficar&#xE1; dispon&#xED;vel para visualiza&#xE7;&#xE3;o e
download.</p>
      <p>Com essa aplica&#xE7;&#xE3;o, almeja-se colaborar para tornar p&#xFA;blico os trabalhos realizados
por alunos de uma IES, fazendo com que o conhecimento adquirido possa ser cada vez mais
difundido.</p>
    </sec>
    <sec id="sec-4">
      <title>1.3. Objetivos Espec&#xED;ficos</title>
      <p>Para que o desenvolvimento da aplica&#xE7;&#xE3;o seja realizado, objetiva-se tamb&#xE9;m:
&#xF0B7; Analisar as ferramentas necess&#xE1;rias que poder&#xE3;o ser &#xFA;teis na convers&#xE3;o dos
textos originais para o formato a ser empregado na base de publica&#xE7;&#xF5;es.
&#xF0B7; Implementar as integra&#xE7;&#xF5;es entre os softwares necess&#xE1;rios.</p>
    </sec>
    <sec id="sec-5">
      <title>1.4. Problematiza&#xE7;&#xE3;o</title>
      <p>Tomando como premissa o conceito de que um trabalho de conclus&#xE3;o de curso &#xE9;
rigorosamente analisado por profissionais da &#xE1;rea t&#xE9;cnica e cient&#xED;fica por diversas vezes antes
de ser dado como finalizado, e que tamb&#xE9;m segue &#xE0; risca os padr&#xF5;es estabelecidos pela ABNT
(Associa&#xE7;&#xE3;o Brasileira de Normas T&#xE9;cnicas), ou pela pr&#xF3;pria institui&#xE7;&#xE3;o de ensino, torna-se
vi&#xE1;vel a ideia da constru&#xE7;&#xE3;o de um software que reconhe&#xE7;a padr&#xF5;es estruturais de texto e
trabalhe em fun&#xE7;&#xE3;o deles para derivar em uma sa&#xED;da com conte&#xFA;do manipul&#xE1;vel, prop&#xED;cio para
publica&#xE7;&#xE3;o em diversos formatos.</p>
      <p>O cen&#xE1;rio atual evidencia que a UNIFAE ainda n&#xE3;o disp&#xF5;e de meios que
proporcionem &#xE0; comunidade em geral, que deseja conhecer mais sobre o potencial cient&#xED;fico
da institui&#xE7;&#xE3;o, um ambiente virtual de pesquisa que armazene e tamb&#xE9;m possibilite a consulta
de trabalhos executados por seus alunos. Logo, presume-se, que a cria&#xE7;&#xE3;o de um portal que se
encarregue de executar tais pap&#xE9;is, poderia transformar a visibilidade externa da faculdade e
tamb&#xE9;m dos trabalhos de seus graduandos.</p>
      <p>Portanto o desenvolvimento de um software que fa&#xE7;a o interm&#xE9;dio entre o processo de
reconhecimento, tratamento, reestrutura&#xE7;&#xE3;o de um documento cient&#xED;fico para publica&#xE7;&#xE3;o
online, e a cria&#xE7;&#xE3;o de um portal que armazene este conte&#xFA;do, vem de encontro com as
necessidades da universidade, que visa, atrav&#xE9;s do conhecimento transmitido na rela&#xE7;&#xE3;o
Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 3
aluno-professor, formar profissionais cada vez mais aptos e dispostos a buscar solu&#xE7;&#xF5;es em
favor das car&#xEA;ncias da sociedade.</p>
    </sec>
    <sec id="sec-6">
      <title>2. Desenvolvimento</title>
    </sec>
    <sec id="sec-7">
      <title>2.1. Referencial Te&#xF3;rico</title>
    </sec>
    <sec id="sec-8">
      <title>2.1.1. Integra&#xE7;&#xE3;o de aplica&#xE7;&#xF5;es</title>
      <p>
        O conceito de integra&#xE7;&#xE3;o de aplica&#xE7;&#xF5;es, definido por
        <xref ref-type="bibr" rid="R8">MARTINS (2005)</xref>
        como a
&#x201C;partilha de informa&#xE7;&#xF5;es e dados entre aplica&#xE7;&#xF5;es em rede ou fontes de dados&#x201D;, corrobora com
a ideia de que com o aumento da quantidade de Sistemas Legados, Web Services, e softwares
em geral, que inevitavelmente com o passar do tempo acabam por perder efici&#xEA;ncia ou
tornam-se obsoletos, muitas corpora&#xE7;&#xF5;es tem adotado estrat&#xE9;gias que viabilizam a integra&#xE7;&#xE3;o
de novos sistemas, ao inv&#xE9;s da cria&#xE7;&#xE3;o de novos softwares que abranjam de forma geral o
escopo de um projeto.
      </p>
      <p>Tais estrat&#xE9;gias s&#xE3;o denominadas EAI (Enterprise Application Integration), que
consistem em um conjunto de boas pr&#xE1;ticas e padr&#xF5;es que auxiliam desenvolvedores e
profissionais da &#xE1;rea da tecnologia no processo de integra&#xE7;&#xE3;o de aplica&#xE7;&#xF5;es.</p>
      <p>
        De acordo com
        <xref ref-type="bibr" rid="R10">RUH, MAGINNIS &amp; BROWN (2002</xref>
        , p. 137) a ado&#xE7;&#xE3;o da abordagem
EAI torna-se mais vi&#xE1;vel para corpora&#xE7;&#xF5;es, pois a substitui&#xE7;&#xE3;o total de um sistema em
funcionamento pode ser arriscada, tanto do ponto de vista econ&#xF4;mico quanto do ponto de vista
t&#xE9;cnico, visto que o processo de desenvolvimento exige grande investimento, profissionais
capacitados, al&#xE9;m de tempo at&#xE9; sua finaliza&#xE7;&#xE3;o.
      </p>
      <p>Diante disto, as corpora&#xE7;&#xF5;es tem optado pelo desenvolvimento de API&#x2019;s (Application
Programming Interface), que s&#xE3;o respons&#xE1;veis por implementar novas tecnologias com o
intuito de complementar os requisitos n&#xE3;o contemplados pela aplica&#xE7;&#xE3;o anterior, al&#xE9;m de
proporcionar a comunica&#xE7;&#xE3;o entre sistemas distintos, independentes de linguagem de
programa&#xE7;&#xE3;o ou arquitetura de software utilizadas.</p>
      <p>
        Dentre os diversos padr&#xF5;es e t&#xE9;cnicas de integra&#xE7;&#xE3;o de aplica&#xE7;&#xF5;es presentes no
mercado, n&#xE3;o &#xE9; correto afirmar que existem t&#xE9;cnicas melhores, que se sobressaiam ante as
demais. Todas possuem suas vantagens e desvantagens, e cabe &#xE0; equipe respons&#xE1;vel pela
Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 4
integra&#xE7;&#xE3;o escolher qual delas &#xE9; mais apropriada para a demanda
        <xref ref-type="bibr" rid="R12">(SORDI &amp; MARINHO,
2007)</xref>
        .
      </p>
      <p>
        De acordo com as abordagens discutidas por
        <xref ref-type="bibr" rid="R12">SORDI &amp; MARINHO (2007)</xref>
        , os
recursos de integra&#xE7;&#xE3;o de sistema s&#xE3;o divididos em tr&#xEA;s mecanismos: mensagem (messaging),
chamadas (call interface) e transfer&#xEA;ncia de arquivos (data access/file transfer). Para o
desenvolvimento do presente trabalho, utilizou-se o mecanismo de chamadas, aplicado por
meio de um web service que atrav&#xE9;s da execu&#xE7;&#xE3;o de requisi&#xE7;&#xF5;es HTTP, possibilitou o envio e
recebimento de dados e arquivos, bem como a comunica&#xE7;&#xE3;o com a plataforma OTS.
      </p>
    </sec>
    <sec id="sec-9">
      <title>2.1.2. Protocolo HTTP e API&#x2019;s Restful</title>
      <p>HRADIL &amp; SKLEN&#xC1;K (2017) ressalta que grande parte das aplica&#xE7;&#xF5;es desenvolvidas
atualmente utilizam a WEB como meio de comunica&#xE7;&#xE3;o com o usu&#xE1;rio, uma vez que a
necessidade de acesso aos dados utilizando os mais variados tipos de dispositivos tem se
tornado cada vez maior.</p>
      <p>Dentre as diversas formas de implenta&#xE7;&#xE3;o de web services, destaca-se o estilo
arquitetural REST (Representational State Transfer) no desenvolvimento desta aplica&#xE7;&#xE3;o, pois
proporciona um conjunto padronizado de requisi&#xE7;&#xF5;es e respostas enviadas a um servidor,
viabilizando assim, uma comunica&#xE7;&#xE3;o clara entre sistemas diferentes. A arquitetura REST se
baseia no uso do protocolo HTTP (Hypertext Transfer Protocol), considerado como o
protocolo b&#xE1;sico de transfer&#xEA;ncia de dados e arquivos de hiperm&#xED;dia.</p>
      <p>O protocolo HTTP &#xE9; dividido em m&#xE9;todos, que permitem a realiza&#xE7;&#xE3;o de diferentes
tipos de a&#xE7;&#xF5;es via requisi&#xE7;&#xE3;o. S&#xE3;o utilizadas no desenvolvimento da aplica&#xE7;&#xE3;o proposta os
seguintes m&#xE9;todos e finalidades:
&#xF0B7; POST: grava&#xE7;&#xE3;o de dados;
&#xF0B7; GET: consulta de dados;
&#xF0B7; PUT: altera&#xE7;&#xE3;o de dados existentes;
&#xF0B7; DELETE: remo&#xE7;&#xE3;o de dados do servidor.</p>
      <p>Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 5</p>
    </sec>
    <sec id="sec-10">
      <title>2.1.3. Extra&#xE7;&#xE3;o de informa&#xE7;&#xF5;es de arquivos estruturados</title>
      <p>
        A abordagem da extra&#xE7;&#xE3;o de informa&#xE7;&#xE3;o de documentos de textos estruturados &#xE9; um
conceito bastante abordado na &#xE1;rea da Tecnologia da Informa&#xE7;&#xE3;o. Atrelado a este conceito,
pode-se observar que em grande parte dos casos, faz-se necess&#xE1;rio o reconhecimento e
extra&#xE7;&#xE3;o de conte&#xFA;do para a obten&#xE7;&#xE3;o de dados estruturados, que quando aplicados em
determinado cen&#xE1;rio, passam a ter maior significado sem&#xE2;ntico para posterior manipula&#xE7;&#xE3;o e
obten&#xE7;&#xE3;o dos chamados metadados, que por sua vez, resumem-se na ideia de &#x201C;dado sobre o
dado&#x201D; ou na &#x201C;cataloga&#xE7;&#xE3;o do dado ou descri&#xE7;&#xE3;o do recurso eletr&#xF4;nico.&#x201D;, de acordo com
        <xref ref-type="bibr" rid="R13">(SOUZA, VENDRUSCULO &amp; MELO, 2000)</xref>
        .
      </p>
      <p>Ap&#xF3;s serem extra&#xED;dos, tais metadados passam a ser tratados como estruturas sujeitas a
processamento computacional e podem ser utilizados para a cria&#xE7;&#xE3;o de conte&#xFA;do em diversos
formatos, inclusive os voltados &#xE0; publica&#xE7;&#xE3;o online. Os metadados, segundo VANTI (2010),
tamb&#xE9;m s&#xE3;o utilizados para a produ&#xE7;&#xE3;o de dados estat&#xED;sticos voltados &#xE0; medi&#xE7;&#xE3;o de &#xED;ndices de
produtividade de centros de pesquisa, identificando &#xE1;reas e cursos que necessitam de uma
abordagem diferenciada, visando o aumento de seu potencial, al&#xE9;m de tamb&#xE9;m serem
utilizados como ferramenta auxiliar de gest&#xE3;o para a aloca&#xE7;&#xE3;o de recursos dentro de uma
institui&#xE7;&#xE3;o de ensino.</p>
      <p>Este processo de extra&#xE7;&#xE3;o faz uso de diversos softwares de automa&#xE7;&#xE3;o, que partindo
dos documentos de entrada, resultam em arquivos de formatos espec&#xED;ficos, bem estruturados e
especificamente criados para facilitar o processo de organiza&#xE7;&#xE3;o e identifica&#xE7;&#xE3;o do conte&#xFA;do.
Dentre os principais formatos de arquivos com tais caracter&#xED;sticas, destacam-se o Text
Encoding Initiative (TEI) e o Extensible Markup Language (XML).</p>
      <p>
        Os documentos TEI s&#xE3;o definidos como uma estrutura de arquivo de texto, utilizada
para preservar o conte&#xFA;do atrav&#xE9;s da cria&#xE7;&#xE3;o de uma estrutura de identifica&#xE7;&#xE3;o, que viabiliza a
leitura por meio de softwares espec&#xED;ficos, voltados ao reconhecimento e extra&#xE7;&#xE3;o de textos. A
codifica&#xE7;&#xE3;o TEI de um texto permite criar um documento com marca&#xE7;&#xF5;es para uso em
programas especificamente desenvolvidos para a an&#xE1;lise textual, que reconhecem os objetos e
seus significados atrav&#xE9;s das tags TEI.
        <xref ref-type="bibr" rid="R9">(RANKIN &amp; LEES , 2015 p. 5)</xref>
        .
      </p>
      <p>Os documentos XML podem ser determinados como uma linguagem de marca&#xE7;&#xE3;o
com a qual pode ser especificada a forma dos dados no documento e defini&#xE7;&#xF5;es sem&#xE2;nticas.
&#x201C;Um arquivo eletr&#xF4;nico XML pode conter, simultaneamente, dados e a descri&#xE7;&#xE3;o da estrutura
Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 6
do documento, atrav&#xE9;s do DTD-Data Type Definitions (gram&#xE1;ticas que conferem estrutura ao
documento XML).&#x201D; (ALMEIDA, 2002, p. 7).</p>
    </sec>
    <sec id="sec-11">
      <title>2.1.4. Open Typesetting Stack (OTS)</title>
      <p>A API OTS &#xE9; um servi&#xE7;o WEB open-source, mantido pela iniciativa Public
Knowledge Project (PKP)1, que visa efetuar a convers&#xE3;o de documentos para o formato
XML-JATS, de maneira mais intuitiva que outras ferramentas, com abordagem simples, e
entrega de uma interface gr&#xE1;fica de f&#xE1;cil usabilidade, conforme Figura 1.</p>
      <p>Figura 1. Demonstra&#xE7;&#xE3;o da interface de submiss&#xF5;es &#xE0; plataforma Open Typesetting Stack.</p>
      <p>Fonte: Open Typesetting Stack2.
1 Iniciativa Open Source desenvolvedora de solu&#xE7;&#xF5;es para aux&#xED;lio &#xE0; profissionais no ramo de
publica&#xE7;&#xF5;es cient&#xED;ficas. Dispon&#xED;vel em: https://pkp.sfu.ca/.
2 http://pkp-xml-demo.lib.sfu.ca/</p>
      <p>Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 7</p>
      <p>Segundo GARNETT et al. (2017), esta ferramenta utiliza diversas bibliotecas de
acesso aberto (como por exemplo, o software meTypeset) para a realiza&#xE7;&#xE3;o do processo de
convers&#xE3;o de um documento. No processamento realizado pelo software meTypeset, de
acordo com GARNETT, ALPERIN &amp; WILLINSKY (2015), s&#xE3;o empregadas grandes
quantidades de estruturas de dados que utilizam princ&#xED;pios de heur&#xED;stica e aplica&#xE7;&#xE3;o de
parseamento baseado em l&#xF3;gica fuzzy, partindo de um documento DOCX, passando pela
transforma&#xE7;&#xE3;o para o formato TEI e posterior obten&#xE7;&#xE3;o de um arquivo XML-JATS.</p>
      <p>Na Figura 2 &#xE9; demonstrado o fluxo de processamento da ferramenta meTypeSet, na
qual pode ser observado que a entrada pode ser constitu&#xED;da de documentos contendo textos
fornecidos a partir de diferentes ferramentas como Microsoft Office Word, ou LibreOffice. A
partir dela, conforme mencionado, pode ser obtido um arquivo equivalente no formato XML.</p>
      <sec id="sec-11-1">
        <title>Figura 2. Fluxo de processamento da ferramenta meTypeset.</title>
        <p>Fonte: Eve (2015).</p>
        <p>A API OTS foi escolhida neste trabalho, pois seu &#xED;ndice de assertividade e
compatibilidade dos documentos de sa&#xED;da chega a uma m&#xE9;dia de 80% em rela&#xE7;&#xE3;o a padr&#xF5;es
exigidos pela especifica&#xE7;&#xE3;o XML-JATS.</p>
      </sec>
    </sec>
    <sec id="sec-12">
      <title>2.2. Materiais e M&#xE9;todos</title>
      <p>O software proposto foi constru&#xED;do segundo a arquitetura Cliente-Servidor e para a
apresenta&#xE7;&#xE3;o dos recursos utilizados durante o desenvolvimento, podemos agrup&#xE1;-los em
categorias, para melhor entendimento:</p>
      <p>Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 8
2.2.1. Front-end
2.2.2. Back-end</p>
      <p>
        O front-end &#xE9; parte relacionada &#xE0; exibi&#xE7;&#xE3;o do software em uma interface web, e para o
desenvolvimento desta etapa foram utilizados conceitos b&#xE1;sicos da &#xE1;rea de desenvolvimento
web como HTML (HyperText Markup Language) e CSS (Cascading Style Sheets) e
Javascript somados &#xE0; utiliza&#xE7;&#xE3;o do framework Angular em sua vers&#xE3;o 6.1.7. A escolha do
framework Angular deu-se devido sua popularidade, performance e especialmente &#xE0; sua
grande comunidade de desenvolvedores ao redor do mundo que destinam parte do seu tempo
na cria&#xE7;&#xE3;o de solu&#xE7;&#xF5;es e plugins que facilitam a vida dos desenvolvedores que a utilizam. Tais
fatores fazem do Angular um dos melhores frameworks Javascript da atualidade
        <xref ref-type="bibr" rid="R11">(SESHADRI,
2018)</xref>
        .
      </p>
      <p>Nesta categoria, do lado servidor, foi utilizada a plataforma OTS para convers&#xE3;o dos
documentos WORD em XML, HTML ou PDF. Para isso, foi necess&#xE1;ria a implementa&#xE7;&#xE3;o de
web services que permitissem a integra&#xE7;&#xE3;o desta plataforma com o software em
desenvolvimento. Para a implementa&#xE7;&#xE3;o dos web services, foi escolhida a arquitetura REST.
Para a constru&#xE7;&#xE3;o desta integra&#xE7;&#xE3;o e das regras de neg&#xF3;cio presentes no back-end foi utilizada
a linguagem JAVA vers&#xE3;o 8 em conjunto com o framework Spring Boot em sua vers&#xE3;o 2.0.4,
devido sua facilidade em acelerar o processo de configura&#xE7;&#xE3;o de uma aplica&#xE7;&#xE3;o Spring
(ANTONOV, 2018).</p>
    </sec>
    <sec id="sec-13">
      <title>2.2.3. Ferramentas estruturais e de apoio</title>
      <p>Nesta categoria, ser&#xE3;o listadas as ferramentas que tornaram mais f&#xE1;ceis a intera&#xE7;&#xE3;o e o
gerenciamento do projeto:
&#xF0B7; Controle de vers&#xF5;es: utilizou-se GIT somado &#xE0; plataforma de hospedagem de
c&#xF3;digos-fonte Bitbucket3.</p>
      <sec id="sec-13-1">
        <title>3 https://bitbucket.org</title>
        <p>Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 9
&#xF0B7;
&#xF0B7;
&#xF0B7;</p>
        <p>Organiza&#xE7;&#xE3;o de tarefas do projeto: utilizou-se o Trello4, que aliado &#xE0;
metodologia &#xE1;gil Kanban, pode proporcionar uma excelente vis&#xE3;o das tarefas a
serem executadas.</p>
        <p>Armazenamento de dados: utilizou-se o SGBD Oracle Database Express
Edition 11g Release 2, que proporciona ao desenvolvedor, de forma gratuita,
facilidade na administra&#xE7;&#xE3;o e manuten&#xE7;&#xE3;o5.</p>
        <p>Armazenamento dos documentos: utilizou-se o sistema de arquivos do
ambiente em que o sistema est&#xE1; hospedado. Esta estrat&#xE9;gia visa a economia no
armazenamento de dados em um SGBD, visto que a vers&#xE3;o utilizada na
implementa&#xE7;&#xE3;o deste projeto &#xE9; uma vers&#xE3;o gratuita e possui limita&#xE7;&#xF5;es de
armazenamento. Portanto, foram utilizados campos do formato VARCHAR(2)
destinados ao armazenamento de refer&#xEA;ncias aos diret&#xF3;rios em que o arquivos
foram armazenados. Assim, no momento da recupera&#xE7;&#xE3;o dos arquivos para a
exibi&#xE7;&#xE3;o na camada de apresenta&#xE7;&#xE3;o, uma rotina se encarrega de compor o path
dos arquivos para que sejam exibidos ao usu&#xE1;rio da forma correta.</p>
      </sec>
    </sec>
    <sec id="sec-14">
      <title>3. Resultados e Discuss&#xF5;es</title>
      <p>Como resultado deste trabalho, foi constru&#xED;do um software que atende aos seguintes
requisitos funcionais:
&#xF0B7; Cadastro de alunos;
&#xF0B7; Cadastro de cursos e turmas;
&#xF0B7; Cadastro de submiss&#xF5;es de documentos referentes a artigos ou trabalhos
acad&#xEA;micos;
&#xF0B7; Listagem de submiss&#xF5;es de documentos por curso e turma;
&#xF0B7; Listagem individual de um documento submetido, em uma p&#xE1;gina HTML,
contendo as informa&#xE7;&#xF5;es b&#xE1;sicas de um artigo (t&#xED;tulo, autores, resumo e
palavras-chave), bem como links para download do documento na vers&#xE3;o PDF.</p>
      <p>A principal integra&#xE7;&#xE3;o implementada neste sistema foi realizada com o
desenvolvimento de um web service para permitir que o usu&#xE1;rio realize a submiss&#xE3;o de</p>
      <sec id="sec-14-1">
        <title>4 https://trello.com/</title>
        <p>Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 10
documentos cient&#xED;ficos estruturados no formato Word e que o software web obtenha como
retorno, desta requisi&#xE7;&#xE3;o, arquivos nos formatos HTML, XML e PDF que s&#xE3;o produzidos pela
plataforma OTS. Tais documentos s&#xE3;o posteriormente disponibilizados online pelo software
web, conforme ilustrado na Figura 3.</p>
        <sec id="sec-14-1-1">
          <title>Figura 3. Diagrama de fluxo de arquivos no processo de submiss&#xE3;o.</title>
          <p>O processo de submiss&#xE3;o d&#xE1;-se da seguinte forma:
i. O usu&#xE1;rio submete o arquivo Word ao sistema.
ii. A submiss&#xE3;o &#xE9; armazenada em uma fila tempor&#xE1;ria no sistema, que ao fim do
dia atrav&#xE9;s de um scheduler de tarefas, comp&#xF5;e o lote a ser enviado a
plataforma OTS. Os arquivos s&#xE3;o enviados um a um via requisi&#xE7;&#xE3;o HTTP
(m&#xE9;todo POST) &#xE0; plataforma OTS, que se encarrega de converter o documento
para outros formatos.
iii. Devido a uma conven&#xE7;&#xE3;o adotada no desenvolvimento deste projeto, tr&#xEA;s horas
ap&#xF3;s a submiss&#xE3;o, o sistema faz requisi&#xE7;&#xF5;es &#xE0; plataforma (tamb&#xE9;m atrav&#xE9;s da
utiliza&#xE7;&#xE3;o de um scheduler de tarefas), para verificar o status do processo de
Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 11
convers&#xE3;o. Tais status est&#xE3;o dispon&#xED;veis para consulta na documenta&#xE7;&#xE3;o do
OTS no Github6.
iv. Caso os documentos j&#xE1; tenham sido processados, o sistema solicita via
requisi&#xE7;&#xE3;o HTTP o retorno dos arquivos da plataforma, que os envia como
resposta.
v. Os arquivos vindos do OTS s&#xE3;o armazenados no sistema de arquivos e Sistema
de Gerenciamento de Banco de Dados (SGBD).</p>
          <p>Para a execu&#xE7;&#xE3;o do processo de envio dos arquivos via requisi&#xE7;&#xE3;o HTTP, utilizou-se a
impementa&#xE7;&#xE3;o de uma fila de submiss&#xF5;es, onde os arquivos submetidos durante o dia s&#xE3;o
enfileirados, e devido a uma conven&#xE7;&#xE3;o adotada na implementa&#xE7;&#xE3;o do projeto para n&#xE3;o
sobrecarregar o servidor em momentos de picos de entregas de trabalhos, definiu-se que seus
itens seriam enviados em uma requisi&#xE7;&#xE3;o HTTP POST em determinado hor&#xE1;rio, e que ap&#xF3;s
tr&#xEA;s horas o sistema faria outra requisi&#xE7;&#xE3;o HTTP, para obter os arquivos anteriormente
enviados (GET). Tal implementa&#xE7;&#xE3;o tornou-se poss&#xED;vel atrav&#xE9;s da utiliza&#xE7;&#xE3;o de um campo do
tipo boolean pr&#xE9; definido na esturutra da tabela de submiss&#xF5;es, que assumiu o papel de flag,
possibilitando a indica&#xE7;&#xE3;o se o arquivo havia ou n&#xE3;o sido enviado &#xE0; plataforma.</p>
          <p>As requisi&#xE7;&#xF5;es HTTP GET utilizaram como par&#xE2;metro de identifica&#xE7;&#xE3;o o campo
OTS_ID presente na tabela de submiss&#xF5;es. Este campo corresponde ao identificador recebido
por cada publica&#xE7;&#xE3;o no momento em que a requisi&#xE7;&#xE3;o &#xE9; recebida pela plataforma OTS.</p>
          <p>Ao t&#xE9;rmino do desenvolvimento deste trabalho, foi poss&#xED;vel obter a integra&#xE7;&#xE3;o de um
novo software com a plataforma OTS, inicialmente vislumbrada para desempenhar a
importante fun&#xE7;&#xE3;o de facilitar a divulga&#xE7;&#xE3;o das pesquisas realizadas na institui&#xE7;&#xE3;o, e a
obten&#xE7;&#xE3;o dos seguintes resultados:
&#xF0B7; Realiza&#xE7;&#xE3;o de requisi&#xE7;&#xF5;es HTTP com o m&#xE9;todo POST &#xE0; plataforma OTS,
permitindo com que o usu&#xE1;rio submeta arquivos no formato Word e PDF.
&#xF0B7; Realiza&#xE7;&#xE3;o de requisi&#xE7;&#xF5;es HTTP com o m&#xE9;todo GET &#xE0; plataforma OTS,
viabilizando a consulta ao status de processamento dos arquivos submetidos e
tamb&#xE9;m a obten&#xE7;&#xE3;o dos arquivos processados.
&#xF0B7; Implementa&#xE7;&#xE3;o de uma interface voltada ao reposit&#xF3;rio de artigos de uma
institui&#xE7;&#xE3;o, que permite o cadastro de alunos, cursos, turmas e submiss&#xF5;es de
artigos, e possibilita ao p&#xFA;blico o acesso ao conte&#xFA;do cient&#xED;fico submetido.</p>
        </sec>
      </sec>
      <sec id="sec-14-2">
        <title>6 https://github.com/pkp/ots</title>
        <p>Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 12</p>
        <p>Diante dos resultados obtidos, constatou-se que a plataforma OTS cumpre a proposta
definida por seus criadores no que tange ao cen&#xE1;rio de transforma&#xE7;&#xE3;o de um arquivo Word ou
PDF em formatos diversos. Entretanto, &#xE9; importante ressaltar que a qualidade obtida nos
documentos de sa&#xED;da, vindos da plataforma, depende diretamente do arquivo fonte, e da forma
pelo qual &#xE9; estruturado e, embora tenha uma assertividade de 80%, algumas vezes o OTS
produz resultados que n&#xE3;o s&#xE3;o suficientemente satisfat&#xF3;rios e que precisam de uma solu&#xE7;&#xE3;o
supervisionada ao t&#xE9;rmino de seu trabalho, conforme mencionado em GARNETT et al.
(2017)</p>
      </sec>
    </sec>
    <sec id="sec-15">
      <title>4. Considera&#xE7;&#xF5;es Finais</title>
      <p>O desenvolvimento do presente estudo possibilitou a cria&#xE7;&#xE3;o de uma aplica&#xE7;&#xE3;o voltada
&#xE0; preserva&#xE7;&#xE3;o de artigos cient&#xED;ficos desenvolvidos por uma institui&#xE7;&#xE3;o de ensino, atrav&#xE9;s da
utiliza&#xE7;&#xE3;o de princ&#xED;pios de integra&#xE7;&#xE3;o de software, proporcionando &#xE0; comunidade cient&#xED;fica e
ao p&#xFA;blico em geral, acesso ao conte&#xFA;do produzido por alunos de gradua&#xE7;&#xE3;o, com o intuito da
difus&#xE3;o do conte&#xFA;do cient&#xED;fico e aumento da visibilidade da institui&#xE7;&#xE3;o frente &#xE0; sociedade.</p>
      <p>O presente trabalho possui sua aplica&#xE7;&#xE3;o voltada ao &#xE2;mbito acad&#xEA;mico, no entanto,
tamb&#xE9;m possibilita sua utiliza&#xE7;&#xE3;o como ferramenta de apoio no desenvolvimento de solu&#xE7;&#xF5;es
que utilizem como fonte a plataforma OTS.</p>
      <p>Para futuras implementa&#xE7;&#xF5;es, pode ser considerada a inclus&#xE3;o das seguintes
funcionalidades:
&#xF0B7; Melhoria na estrutura&#xE7;&#xE3;o do banco de dados e estudo da viabilidade de uma
poss&#xED;vel migra&#xE7;&#xE3;o para a tecnologia NOSQL, que facilita aspectos relacionados
&#xE0; busca r&#xE1;pida de dados e &#xE9; comumente utilizada para a recupera&#xE7;&#xE3;o de um
grande fluxo de dados.
&#xF0B7; Implementa&#xE7;&#xE3;o de um dashboard com dados estat&#xED;sticos &#xE0; respeito da
quantidade de artigos publicados por curso, quais cursos precisam aumentar
seu potencial cient&#xED;fico em rela&#xE7;&#xE3;o aos demais, dentre outros aspectos que
auxiliem os gestores de uma institui&#xE7;&#xE3;o de ensino superior a impulsionarem a
produ&#xE7;&#xE3;o de material cient&#xED;fico.</p>
      <p>&#xF0B7; Elaborar sistema de busca de artigos por t&#xED;tulo, palavras-chave e autores.
Centro Universit&#xE1;rio das Faculdades Associadas de Ensino, UNIFAE, S&#xE3;o Jo&#xE3;o da Boa Vista &#x2013; SP, Brasil. 13
ALMEIDA, M. B. Uma introdu&#xE7;&#xE3;o ao XML, sua utiliza&#xE7;&#xE3;o na Internet e alguns conceitos
complementares. Ci. Inf., Bras&#xED;lia, v. 31, n. 2, p. 5-13, Aug. 2002. Dispon&#xED;vel em:
&lt;http://www.scielo.br/scielo.php?script=sci_arttext&amp;pid=S010019652002000200001&amp;lng=en&amp;nrm=iso&gt;. Acesso em: 07 de Maio de 2018.
http://dx.doi.org/10.1590/S0100-19652002000200001.</p>
      <p>ANTONOV, A. Spring Boot Cookbook. Birmingham: Packt Publishing, 2018.</p>
      <p>EVE, M. P. Building a real XML-first (XML-in) workflow for scholarly typesetting. 2015. Dispon&#xED;vel
em:
&lt;https://www.martineve.com/2015/07/20/building-a-real-xml-first-workflow-for-scholarlytypesetting/&gt;. Acesso em: 20 de Abril de 2018.</p>
      <p>FURNIVAL, A. C.; HUBBARD, B. Acesso Aberto &#xE0;s Publica&#xE7;&#xF5;es Cient&#xED;ficas: vantagens, pol&#xED;ticas e
advocacy. InCID: Revista de Ci&#xEA;ncia da Informa&#xE7;&#xE3;o e Documenta&#xE7;&#xE3;o, v. 2, n. 2, p. 160-177, 12 Dez.
2011.</p>
      <p>GARNETT, A. et al. Introducing Texture: An Open Source WYSIWYG Javascript Editor for JATS.
In: JOURNAL ARTICLE TAG SUITE CONFERENCE (JATS-Con), 2017, Bethesda. Proceedings
[Internet]. Bethesda (MD): National Center for Biotechnology Information (US), 2017. Dispon&#xED;vel
em: &lt;https://www.ncbi.nlm.nih.gov/books/NBK425544/&gt;.</p>
      <p>GARNETT, A.; ALPERIN, J. P.; WILLINSKY, J. The Public Knowledge Project XML Publishing
Service and meTypeset: Don't call it "Yet Another Word-to-JATS Conversion Kit". In: JOURNAL
ARTICLE TAG SUITE CONFERENCE (JATS-Con), 2015, Bethesda. Proceedings [Internet].
Bethesda (MD): National Center for Biotechnology Information (US), 2015. Dispon&#xED;vel em:
&lt;https://www.ncbi.nlm.nih.gov/books/NBK279666/&gt;.</p>
      <p>HRADIL, J.; SKLEN&#xC1;K, V. Practical Implementation of 10 Rules for Writing REST APIs. Journal of
Systems Integration, v. 8, n. 1, p. 45-54, 2017.
VANTI, N. Indicadores web e sua aplica&#xE7;&#xE3;o &#xE0; produ&#xE7;&#xE3;o cient&#xED;fica disponibilizada em revistas
eletr&#xF4;nicas. In: FERREIRA, S. M. S. P.; TARGINO, M. G. (Org.). Acessibilidade e visibilidade
de revistas cient&#xED;ficas eletr&#xF4;nicas. S&#xE3;o Paulo: Ed. SENAC, 2010. p. 175-212.</p>
    </sec>
  </body>
  <back>
    <ref-list><ref id="R8"><element-citation publication-type="journal"><person-group person-group-type="author"><name><surname>Silva</surname><given-names>Lu&#xED;s</given-names></name><name><surname>Varaj&#xE3;o</surname><given-names>andJo&#xE3;o</given-names></name><name><surname>Dominguez</surname><given-names>Caroline</given-names></name><name><surname>Moura</surname><given-names>Isabel</given-names></name><name><surname>and</surname><given-names>and</given-names></name></person-group><article-title>MOTIVA&#xC7;&#xD5;ES PARA O ELEVADO DESEMPENHO EM EQUIPAS DE PROJETOS DE SISTEMAS DE INFORMA&#xC7;&#xC3;O</article-title><source>Atas da 17&#xAA; Confer&#xEA;ncia da Associa&#xE7;&#xE3;o Portuguesa de Sistemas de Informa&#xE7;&#xE3;o</source><publisher-name>Associa&#xE7;&#xE3;o Portuguesa de Sistemas de Informa&#xE7;&#xE3;o, APSI</publisher-name><year>2017</year><pub-id pub-id-type="doi">10.18803/capsi.v17.185-193</pub-id></element-citation></ref><ref id="R9"><element-citation publication-type="journal"><person-group person-group-type="author"><name><surname>Rankin</surname><given-names>Sharon</given-names></name><name><surname>Lees</surname><given-names>Casey</given-names></name></person-group><article-title>The McGill library chapbook project: a case study in TEI encoding</article-title><source>OCLC Systems &amp; Services: International digital library perspectives</source><year>2015-aug</year><fpage>134</fpage><lpage>143</lpage><pub-id pub-id-type="doi">10.1108/oclc-07-2014-0030</pub-id></element-citation></ref><ref id="R10"><element-citation publication-type="journal"><person-group person-group-type="author"/><article-title>Wiley Encyclopedia of Molecular Medicine</article-title><year>2002</year><pub-id pub-id-type="doi">10.1002/0471203076</pub-id></element-citation></ref><ref id="R11"><element-citation publication-type="journal"><person-group person-group-type="author"><name><surname>Zhu</surname><given-names>Sheng</given-names></name><name><surname>Pidishety</surname><given-names>Shankar</given-names></name><name><surname>Nilsson</surname><given-names>Johan</given-names></name></person-group><article-title>15-dB Raman Amplification of an Optical Orbital Angular Momentum Mode in a Step-Index Fiber</article-title><source>Laser Congress 2018 (ASSL)</source><publisher-name>OSA</publisher-name><year>2018</year><pub-id pub-id-type="doi">10.1364/assl.2018.aw2a.4</pub-id></element-citation></ref><ref id="R12"><element-citation publication-type="journal"><person-group person-group-type="author"><name><surname>Abreu</surname><given-names>ChrystyaneGerthSilveira</given-names></name><name><surname>Souza</surname><given-names>AnaLuizaLimaDe</given-names></name><name><surname>C&#xE2;mara</surname><given-names>MusbahKoleilat</given-names></name></person-group><article-title>Efici&#xEA;ncia operacional e concentra&#xE7;&#xE3;o de mercado: uma an&#xE1;lise comparativa entre as empresas brasileiras de transporte a&#xE9;reo de passageiros</article-title><source>Sistemas &amp; Gest&#xE3;o</source><year>2017-sep</year><pub-id pub-id-type="doi">10.20985/1980-5160.2017.v12n3.986</pub-id></element-citation></ref><ref id="R13"><element-citation publication-type="journal"><person-group person-group-type="author"><name><surname>Souza</surname><given-names>MarciaIzabelFugisawa</given-names></name><name><surname>Vendrusculo</surname><given-names>LaurimarGon&#xE7;alves</given-names></name><name><surname>Melo</surname><given-names>GeaneCristina</given-names></name></person-group><article-title>Metadados para a descri&#xE7;&#xE3;o de recursos de informa&#xE7;&#xE3;o eletr&#xF4;nica: utiliza&#xE7;&#xE3;o do padr&#xE3;o Dublin Core</article-title><source>Ci&#xEA;ncia da Informa&#xE7;&#xE3;o</source><year>2000-apr</year><fpage>93</fpage><lpage>102</lpage><pub-id pub-id-type="doi">10.1590/s0100-19652000000100010</pub-id></element-citation></ref><ref id="R14"><element-citation publication-type="journal"><person-group person-group-type="author"><name><surname>Almeida</surname><given-names>LeonardoHolandade</given-names></name><name><surname>Batista</surname><given-names>Carolina</given-names></name><name><surname>Cerceau</surname><given-names>Renato</given-names></name></person-group><article-title>Sa&#xFA;de Suplementar Estado de S&#xE3;o Paulo Regional de Sa&#xFA;de S&#xE3;o Jo&#xE3;o da Boa Vista</article-title><year>2013</year><pub-id pub-id-type="doi">10.17655/9788567211121</pub-id></element-citation></ref></ref-list>
  </back>
</article>
